Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/c-api.tmx
Source language: en
Languages: pl

source: There are some subtle differences; in particular, :cfunc:`PyEval_RestoreThread` saves and restores the value of the global variable :cdata:`errno`, since the lock manipulation does not guarantee that :cdata:`errno` is left alone. Also, when thread support is disabled, :cfunc:`PyEval_SaveThread` and :cfunc:`PyEval_RestoreThread` don't manipulate the GIL; in this case, :cfunc:`PyEval_ReleaseLock` and :cfunc:`PyEval_AcquireLock` are not available. This is done so that dynamically loaded extensions compiled with thread support enabled can be loaded by an interpreter that was compiled with disabled thread support.
pl: Istnieją pewne drobne różnice; w szczególności, :cfunc:`PyEval_RestoreThread` zachowuje i przywraca wartość zmiennej globalnej :cdata:`errno`, biorąc pod uwagę to, że zmiany dokonywane na blokadzie nie gwarantują, że zmienna :cdata:`errno` zostanie zostawiona w spokoju. Także gdy wsparcie dla wątków jest wyłączone, zadabue :cfunc:`PyEval_SaveThread` i :cfunc:`PyEval_RestoreThread` nie zmieniają GILa; w tym przypadku zadania :cfunc:`PyEvalReleaseLock` i :cfunc:`PyEval_AcquireLock` nie są dostępne. Jest to zrobione tak, aby dynamicznie ładowane rozszerzenia kompilowane ze wsparciem dla wątków włączonym mogły być ładowane przez program interpretujący polecenia języka pytonowskiego który został utworzony z wyłączonym wsparciem dla wątków.

source: The global interpreter lock is used to protect the pointer to the current thread state. When releasing the lock and saving the thread state, the current thread state pointer must be retrieved before the lock is released (since another thread could immediately acquire the lock and store its own thread state in the global variable). Conversely, when acquiring the lock and restoring the thread state, the lock must be acquired before storing the thread state pointer.
pl: GIL - 'global interpreter lock' nadrzędna blokada programu interpretującego polecenia języka pytonowskiego jest używany do ochrony wskaźnika na obecny stan wątku. W czasie zwalniania blokady, wskaźnik na stan aktualnego wątku musi zostać odebrany zanim blokada zostanie zwolniona (gdyż inny wątek mógłby natychmiast przejąć blokadę i zapamiętać stan swojego własnego wątku w zmiennej nadrzędnej). Wtórnie, po przejęciu blokady i przywróceniu stanu wątku, blokada musi być przejęta przed zachowaniem wskaźnika stanu wątku.

source: It is important to note that when threads are created from C, they don't have the global interpreter lock, nor is there a thread state data structure for them. Such threads must bootstrap themselves into existence, by first creating a thread state data structure, then acquiring the lock, and finally storing their thread state pointer, before they can start using the Python/C API. When they are done, they should reset the thread state pointer, release the lock, and finally free their thread state data structure.
pl: Warto zauważyć, że gdy wątki są tworzone z C, nie mają nadrzędnej blokady, ani nie ma dla nich struktury danych stanu wątku. Takie wątki muszą wciągnąć się za przysłowiowe szelki do istnienia, najpierw tworząc strukturę danych stanu wątku, potem przejmując zatrzask, i w końcu zapamiętując wskaźnik na ich stan wątku, zanim będzie mógł być rozpoczęty przy użyciu sprzęgu programowania zrębem między językami pytonowskim i C (API). Gdy zostaną zakończone powinny zresetować wskaźnik stanu wątku, zwolnić zatrzask, i w końcu zwolnić ich pamięć przydzieloną strukturze danych stanu wątku.

source: Threads can take advantage of the :cfunc:`PyGILState_\*` functions to do all of the above automatically. The typical idiom for calling into Python from a C thread is now::
pl: Wątki mogą korzystać z zadań :cfunc:`PyGILState_\*` aby wykonywać powyższe zadania automatycznie. Typowym idiomem wzywającym zadania języka pytonowskiego z wątku w języku C jest teraz::

source: PyGILState_STATE gstate; gstate = PyGILState_Ensure(); /* Perform Python actions here. */ result = CallSomeFunction(); /* evaluate result */ /* Release the thread. No Python API allowed beyond this point. */ PyGILState_Release(gstate);
pl: PyGILState_STATE gstan; gstan = PyGILState_Ensure(); /* Wykonaj działania w języku pytonowskim tutaj. */ wynik = WykonajPewneZadania(); /* oblicz wynik */ /* Zwolnij wątek. Żadne sprzęgi programowania języka pytonowskiego nie dozwolone po tym miejscu. */ PyGILState_Release(gstan);

source: Note that the :cfunc:`PyGILState_\*` functions assume there is only one global interpreter (created automatically by :cfunc:`Py_Initialize`). Python still supports the creation of additional interpreters (using :cfunc:`Py_NewInterpreter`), but mixing multiple interpreters and the :cfunc:`PyGILState_\*` API is unsupported.
pl: Warto zauważyć, że :cfunc:`PyGILState_\*` zadania przyjmują że istnieje tylko jeden nadrzędny program interpretujący polecenia języka pytonowskiego (tworzony automatycznie przez :cfunc:`Py_Initialize`). Język pytonowski wspiera uruchamianie dodatkowych programów interpretujących polecenia języka pytonowskiego (używając zadania :cfunc:`Py_NewInterpreter`), ale mieszanie kilku programów interpretujących polecenia języka pytonowskiego i sprzęgu programowania :cfunc:`PyGILState_\*` (API) nie jest wspierane.

source: Another important thing to note about threads is their behaviour in the face of the C :cfunc:`fork` call. On most systems with :cfunc:`fork`, after a process forks only the thread that issued the fork will exist. That also means any locks held by other threads will never be released. Python solves this for :func:`os.fork` by acquiring the locks it uses internally before the fork, and releasing them afterwards. In addition, it resets any :ref:`lock-objects` in the child. When extending or embedding Python, there is no way to inform Python of additional (non-Python) locks that need to be acquired before or reset after a fork. OS facilities such as :cfunc:`posix_atfork` would need to be used to accomplish the same thing. Additionally, when extending or embedding Python, calling :cfunc:`fork` directly rather than through :func:`os.fork` (and returning to or calling into Python) may result in a deadlock by one of Python's internal locks being held by a thread that is defunct after the fork. :cfunc:`PyOS_AfterFork` tries to reset the necessary locks, but is not always able to.
pl: Następną wartą zauważenia sprawą o wątkach jest ich zachowanie wobec napotkania wywołania zadania z języka C :cfunc:`fork`. W większości systemów z zadaniem :cfunc:`fork`, po tym jak proces dokonuje podziału tylko wątek, który wywoływał zadanie podziału wątku będzie istniał. To także oznacza, że dowolne inne blokady utrzymywane przez inne wątki nie zostaną nigdy zwolnione. Język pytonowski wprowadza rozwiązanie dla zadania :func:`os.fork` przez przejęcie blokad używanych wewnętrznie, przed rozwidleniem i zwolnienie ich po wszystkim. W dodatku resetuje wszystkie przedmioty-blokady - z ang. :ref:`lock-objects` w wątku potomnym. Przy rozszerzaniu lub zawieraniu programu interpretującego polecenia języka pytonowskiego w programie, nie istnieje żaden sposób, aby poinformować program interpretujący polecenia języka pytonowskiego o (niepochodzących z programu zapisanym w języku pytonowskim) blokadach które należy przejąć przed lub wyzerować po zakończeniu rozwidlenia wątków. Urządzenia systemu operacyjnego (OS) tkaie jak zadanie :cfunc:`posix_atfork` powinny służyć tym samym celom. Dodatkowo, przy rozszerzaniu lub załączaniu programu interpretującego polecenia języka pytonowskiego, wywoływanie zadania :cfunc:`fork` bezpośrednio zamiast przez :func:`os.fork` (i powracając do lub wywołując zadania z poziomu języka pytonowskiego) może skutkować zakleszczeniem jednej z wewnętrznych blokad programu interpretującego języka pytonowskiego utrzymywanych przez wątek, który został wyłączony po rozwidleniu. Zadanie :cfunc:`PyOS_AfterFork` próbuje rozwiązać odpowiednie blokady, choć nie zawsze jest w stanie.

source: The following macros are normally used without a trailing semicolon; look for example usage in the Python source distribution.
pl: Następujące makropolecenia są za zwyczaj używane bez uwieńczania średnikiem; zobacz też przykładowe użycie w pakiecie źródłowym języka pytonowskiego.

source: All of the following functions are only available when thread support is enabled at compile time, and must be called only when the global interpreter lock has been created.
pl: Wszystkie następujące zadania są dostępne tylko, gdy wspieranie wątków jest włączone w czasie kompilowania programu interpretującego język pytonowski, i mogą być użyte tylko po utworzeniu nadrzędnej blokady programu interpretującego.

source: Asynchronous Notifications
pl: Powiadomienia Asynchroniczne

source: A mechanism is provided to make asynchronous notifications to the main interpreter thread. These notifications take the form of a function pointer and a void argument.
pl: Mechanizm dostarczany w celu wytwarzania niejednoczesnych powiadomień dla głównego wątku programu interpretującego polecenia języka pytonowskiego. Te powiadomienia mają postać wskaźnika na zadanie i pustego parametru.

source: Every check interval, when the global interpreter lock is released and reacquired, Python will also call any such provided functions. This can be used for example by asynchronous IO handlers. The notification can be scheduled from a worker thread and the actual call than made at the earliest convenience by the main thread where it has possession of the global interpreter lock and can perform any Python API calls.
pl: W równych odstępach pomiędzy sprawdzeniami, gdy nadrzędna blokada programu interpretującego jest zwalniana i na powrót przechwytywana, program interpretujący język pytonowski wywołuje każde takie napotkane dostarczone mu zadanie. Może być to użyte na przykład przez niejednoczesne uchwyty wejścia/wyjścia. Powiadomienia mogą być planowane z wyprzedzeniem przez wątek roboczy i właściwe wywołanie potem wykonywane przy najbliższej okazji przez główny wątek który ma w posiadaniu główną blokadę programu interpretującego i może wykonywać dowolne wywołania sprzęgu programowania poleceń języka pytonowskiego (Python API).

source: Profiling and Tracing
pl: Profilowanie (badanie prędkości) i trasowanie (badanie przebiegów) programów języka pytonowskiego.

source: The Python interpreter provides some low-level support for attaching profiling and execution tracing facilities. These are used for profiling, debugging, and coverage analysis tools.
pl: Program interpretujący dostarcza pewnych nisko-poziomowego wsparcia dla doczepiania urządzeń profilowania i badania przebiegów wykonania. Następujące używane są jak narzędzia badania prędkości, odpluskwiania i badania pokrycia.

source: This C interface allows the profiling or tracing code to avoid the overhead of calling through Python-level callable objects, making a direct C function call instead. The essential attributes of the facility have not changed; the interface allows trace functions to be installed per-thread, and the basic events reported to the trace function are the same as had been reported to the Python-level trace functions in previous versions.
pl: Ten sprzęg języka C pozwala aby kod badający prędkość lub badający przebiegi unikał nadmiaru wywoływań przez rzeczy wywoływalne z poziomu języka Pytonowskiego, wykonując zamiast tego bezpośrednie wywołania zadań z języka C. Najważniejsze własności urządzenia nie zmieniły się; sprzęg pozwala zadaniom badającym przebiegi wykonania programu na doczepianie do poszczególnych wątków, a podstawowe zdarzenia raportowane do zadania badania przebiegów programu są takie same jakie były raportowane do zadań badających przebiegi wykonania programu w poprzednich wersjach.

source: Advanced Debugger Support
pl: Wsparcie dla Rozwiniętego Odpluskwiacza

source: These functions are only intended to be used by advanced debugging tools.
pl: Te zadania są przeznaczone tylko dla użycia przez narzędzia rozwiniętego odpluskwiacza.

source: Introduction
pl: Wprowadzenie

source: The Application Programmer's Interface to Python gives C and C++ programmers access to the Python interpreter at a variety of levels. The API is equally usable from C++, but for brevity it is generally referred to as the Python/C API. There are two fundamentally different reasons for using the Python/C API. The first reason is to write *extension modules* for specific purposes; these are C modules that extend the Python interpreter. This is probably the most common use. The second reason is to use Python as a component in a larger application; this technique is generally referred to as :dfn:`embedding` Python in an application.
pl: Sprzęg programowania aplikacji w języku pytonowskim daje programistom języków C i C++ dostęp do programu interpretującego polecenia języka pytonowskiego na wielu poziomach. Sprzęg (API) jest równo użyteczny z poziomu C++ ale dla porządku jest zwykle określany mianem sprzęgu pomiędzy językami pytonowskim a C (z ang. - Python/C API). Istnieją dwie zasadniczo różne przyczyny dla użycia sprzęgu między językami pytonowskim i C. Pierwszą przyczyną jest pisanie *modułów rozszerzających* dla szczególnych powodów; są to moduły języka C, które rozszerzają program interpretujący języka pytonowskiego. To jest zwykle najczęstsze użycie. Drugą przyczyną jest użycie języka pytonowskiego jako komponentu większego programu; ta technika jest zwykle określana mianem załączania - z ang. - :dfn:`embedding` w aplikacji.

source: Writing an extension module is a relatively well-understood process, where a "cookbook" approach works well. There are several tools that automate the process to some extent. While people have embedded Python in other applications since its early existence, the process of embedding Python is less straightforward than writing an extension.
pl: Pisanie rozszerzającego modułu jest względnie dobrze zrozumiałym procesem, gdzie podejście "książki kucharskiej" działa dobrze. Istnieje kilka narzędzi które automatyzują proces do pewnego stopnia. Chociaż załączano program interpretujący język pytonowski od wczesnych lat jego istnienia, jednak proces załączania programu interpretującego język pytonowski jest mniej prosty niż pisanie rozszerzenia.

source: Many API functions are useful independent of whether you're embedding or extending Python; moreover, most applications that embed Python will need to provide a custom extension as well, so it's probably a good idea to become familiar with writing an extension before attempting to embed Python in a real application.
pl: Wiele zadań sprzęgu (API) jest użytecznych niezależnie od tego czy załączasz, czy też rozszerzasz program interpretujący język pytonowski; co więcej, większość aplikacji które załącza program interpretujący polecenia jezyka pytonowskiego potrzebuje także szczególnych rozszerzeń, więc prawdopodobnie jest dobrym pomysłem zaznajomienie się z pisaniem rozszerzenia przed próbą załączenia języka pytonowskiego w prawdziwej aplikacji.

source: Include Files
pl: Pliki Włączania - z ang. Include

source: All function, type and macro definitions needed to use the Python/C API are included in your code by the following line::
pl: Wszystkie zadania, definicje typu i makropoleceń konieczne do użycia sprzęgu między językami pytonowskim i C są włączane do źródeł w kodzie użytkownika przez następującą linijkę::

source: This implies inclusion of the following standard headers: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, ``<limits.h>``, and ``<stdlib.h>`` (if available).
pl: To oznacza włączenie następujących typowych plików nagłówkowych: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, ``<limits.h>``, i ``<stdlib.h>`` (jeśli są dostępne).

source: Since Python may define some pre-processor definitions which affect the standard headers on some systems, you *must* include :file:`Python.h` before any standard headers are included.
pl: Odkąd język pytonowski może definiować pewne definicje preprocesora, które wpływają na pliki nagłówkowe na niektórych systemach, *musisz* załączyć plik :file:`Python.h` zanim jakiekolwiek standardowe nagłówki zostaną załączone.

source: All user visible names defined by Python.h (except those defined by the included standard headers) have one of the prefixes ``Py`` or ``_Py``. Names beginning with ``_Py`` are for internal use by the Python implementation and should not be used by extension writers. Structure member names do not have a reserved prefix.
pl: Wszystkie widoczne dla użytkownika nazwy określone w Python.h ( z wyjątkiem tych określonych przez załączone standardowe pliki nagłówkowe ) mają jeden z przedrostków ``Py`` lub ``_Py``. Nazwy rozpoczynające się od ``_Py`` służą do wewnętrznego użytku przez urzeczywistnienie programu interpretującego języka pytonowskiego i nie powinno być używane przez piszących rozszerzenia. Nazwy członków struktury nie mają zarezerwowanych przedrostków.

source: **Important:** user code should never define names that begin with ``Py`` or ``_Py``. This confuses the reader, and jeopardizes the portability of the user code to future Python versions, which may define additional names beginning with one of these prefixes.
pl: **Istotne:** Kod użytkownika nie powinien nigdy określać nazw które zaczynają się od ``Py`` lub ``_Py``. Wprowadza to zamieszanie dla czytających kod, i utrudnia przenośność kodu użytkownika do przyszłych wersji języka pytonowskiego, które mogą definiować dodatkowe nazwy rozpoczynające się jednym z tych przedrostków.

source: The header files are typically installed with Python. On Unix, these are located in the directories :file:`{prefix}/include/pythonversion/` and :file:`{exec_prefix}/include/pythonversion/`, where :envvar:`prefix` and :envvar:`exec_prefix` are defined by the corresponding parameters to Python's :program:`configure` script and *version* is ``sys.version[:3]``. On Windows, the headers are installed in :file:`{prefix}/include`, where :envvar:`prefix` is the installation directory specified to the installer.
pl: Pliki nagłówkowe są zazwyczaj instalowane z językiem pytonowskim. Na Uniksie, są one umieszczone w katalogach :plik:`{przedrostek}/include/pythonawersja/` i :plik:`{exec_prefix}/include/pythonwersja` gdzie :envvar:`prefix` są zdefiniowane przez korespondujące parametry dla skryptu :program:`configure` konfigurującego program interpretujący języka pytonowskiego i *wersja* jest ``sys.version[:3]``. W Windows, nagłówki są instalowane w katalogu :file:`{przedrostek}/include`, gdzie :envvar:`przedrostek` jest katalog instalacyjny określony w procesie instalacji.

source: To include the headers, place both directories (if different) on your compiler's search path for includes. Do *not* place the parent directories on the search path and then use ``#include <pythonX.Y/Python.h>``; this will break on multi-platform builds since the platform independent headers under :envvar:`prefix` include the platform specific headers from :envvar:`exec_prefix`.
pl: Aby załączyć pliki nagłówkowe, umieść oba katalogi (jeśli są różne) na liście przeszukiwanych ścieżek poszukiwania plików nagłówkowych. *Nie* umieszczaj katalogów nadrzędnych na ścieżkach poszukiwania plików nagłówkowych po czym wpisując ``#include <pythonX.Y/Python.h>``; To spowoduje przerwanie na realizacjach wieloplatformowych gdyż niezależne od platformy nagłówki dostępne w katalogu :envvar:`przedrostek` zawiera pliki nagłówkowe szczególne dla pewnych platform z katalogu :envvar:`exec_prefix`.

source: C++ users should note that though the API is defined entirely using C, the header files do properly declare the entry points to be ``extern "C"``, so there is no need to do anything special to use the API from C++.
pl: Użytkownicy C++ powinni wziąć pod uwagę, że chociaż sprzęg programowania jest dostępny w całości przy użyciu C, pliki nagłówkowe prawidłowo deklarują punkty wejściowe aby następowały ``extern "C"``, tak że nie ma potrzeby robić nic więcej szczególnego aby używać sprzęgu z poziomu języka C++.

source: Objects, Types and Reference Counts
pl: Przedmioty, ich Rodzaje i Liczby Odwołań

source: Most Python/C API functions have one or more arguments as well as a return value of type :ctype:`PyObject\*`. This type is a pointer to an opaque data type representing an arbitrary Python object. Since all Python object types are treated the same way by the Python language in most situations (e.g., assignments, scope rules, and argument passing), it is only fitting that they should be represented by a single C type. Almost all Python objects live on the heap: you never declare an automatic or static variable of type :ctype:`PyObject`, only pointer variables of type :ctype:`PyObject\*` can be declared. The sole exception are the type objects; since these must never be deallocated, they are typically static :ctype:`PyTypeObject` objects.
pl: Większość zadań sprzęgu między językami pytonowskim i C ( z ang. Python/C API) ma jeden lub więcej parametrów zarówno jak wartość zwracaną typu :ctype:`PyObject\*`. Ten rodzaj jest wskaźnikiem na przezroczysty rodzaj danych reprezentujący konkretne przedmioty języka pytonowskiego. Od kiedy wszystkie rodzaje przedmiotów w języku pytonowskim są traktowane tak samo przez język pytonowski w większości sytuacji (np. przypisania, prawa pierwszeństwa nawiasów i przekazywania parametrów), jest zatem zrozumiałe, że powinny być reprezentowane przez jeden rodzaj przedmiotu w języku C. Prawie wszystkie przedmioty języka pytonowskiego wiodą swój żywot na stercie: nigdy nie deklaruje się automatycznych ani statycznych zmiennych rodzaju :ctype:`PyObject`, tylko zmienne wskaźnikowe o rodzaju :ctype:`PyObject\*` mogą być deklarowane. Jedynym wyjątkiem od tej reguły są przedmioty określające rodzaj przedmiotu; ponieważ nigdy nie mogą być one zdjęte, są one zwykle przedmiotami statycznymi :ctype:`PyTypeObject`.

source: All Python objects (even Python integers) have a :dfn:`type` and a :dfn:`reference count`. An object's type determines what kind of object it is (e.g., an integer, a list, or a user-defined function; there are many more as explained in :ref:`types`). For each of the well-known types there is a macro to check whether an object is of that type; for instance, ``PyList_Check(a)`` is true if (and only if) the object pointed to by *a* is a Python list.
pl: Wszystkie przedmioty języka pytonowskiego (nawet liczby całkowite języka pytonowskiego) mają :dfn:`rodzaj` i :dfn:`liczbę odniesień`. Typ przedmiotu określa jakiego rodzaju przedmiot to jest (np. liczba całkowita, lista, lub zadanie zdefiniowane przez użytkownika; jest wiele więcej jak wyjaśniono w :ref:`types`). Dla każdego z dobrze-znanych rodzajów istnieje makropolecenie sprawdzające czy przedmiot jest tego rodzaju; na przykład, ``PyList_Check(a)`` jest prawdziwe wtedy (i tylko wtedy) gdy przedmiot na który wskazuje *a* jest lista z języka pytonowskiego.

source: Reference Counts
pl: Liczby odniesień
